app/controllers/home_controller.rb

SELECT product_id, count(product_id) as sold_quantity FROM "orders" WHERE "orders"."customer_id" = ? AND ("orders"."created_at" BETWEEN '2017-07-16 18:11:06.532695' AND '2017-07-23') GROUP BY "orders"."product_id"  [["customer_id", 1]]
---
  def products
    unless params[:daterange].blank?
      from = params[:daterange].split(" - ")[0].to_date
      to = params[:daterange].split(" - ")[1].to_date
    else
      from = 1.weeks.ago
      to = Date.today
    end
    @orders = current_customer.orders.by_week(from..to).sold_products

SELECT COUNT(*) FROM "orders" WHERE ("orders"."created_at" BETWEEN '2017-07-23' AND '2017-07-29')
SELECT  "orders".* FROM "orders"  ORDER BY "orders"."id" ASC LIMIT 1
SELECT COUNT(*) AS count_all, customer_id AS customer_id FROM "orders" WHERE ("orders"."created_at" BETWEEN '2017-07-17 12:53:29.227118' AND '2017-07-24') GROUP BY "orders"."customer_id"
---
  def customers
    @total_orders = Order.count
    unless params[:daterange].blank?
      from = params[:daterange].split(" - ")[0].to_date
      to = params[:daterange].split(" - ")[1].to_date
      @orders = Order.by_week(from..to).group("customer_id").count.group_by{|key,val| val}.collect{|a,b| {a=>b.count}}.reduce Hash.new, :merge